package day7;

public class Summary {
    // 변수 : 앞에 자료형을 적어줄것, 같은지역에서 같은 이름이 잇으면 안됨
    // 자료형: 자바가 취급하는 자료의 타입 (원시형 객체).
    // 배열 :  변수로는 한계가 있음. 많은 데잉터를 일괄적으로 핸들링
    // 스캐너: 인풋값을 담아줌 넥스트 라인으로 통일할 것
    // 객체 : 배열이랑 비슷, 서로 다른 자료형 저장 가능, 객체는 사람이 생각하는걸 표현하는것을 클래스를 통해서 알려준다.
    // 클라스 : 객체의 설계도
    // 매서드 : 데이터의 집함에서 데이터를 연산하여 움직이게함
    // 리턴 : 매서드에서 실행한다음 실행한곳에서 결과를 넘겨주는 작업
    // 매게변수: 정할 수없는 것을 넣어서 지정해줌
    // 배열리스트 : 배열보다 사용성이 편하다.
    // 큰이유 없으면 어레이리스트를 쓰다가 필요한 부분에 배열을 쓴다.
    // 생성자 : 객체는 자신이 있는 데이터를 올바르게 해야하기 때문에 초기화 실행
    // 누락하지 않고 쓸 수 있게 하기 위해서
    // 클래스명과 동일, 자료형 타입 없음, 매개변수 받을 수 있음, 자동으로 실행됨

    // 1. 객체 지향 없이 프로그램 만들기 선행되어야함


}
