package New;

public class New_24_09_19 {
    /* 오전 자바
    자바 큰 특징 : 객체지향언어(oop) : 객체를 만들어 놓고 조립해서 쓰는 방식

    자바 만든 사람 : 제임스 고슬린
    자바 플랫폼 jdk , jik

    객체(데이터 덩어리)를 만들려면 설계도(class)가 필요함
    객체 생성 방법을 통해 메모리에 데이터 생성

    변수 : 가상공간에 데이터를 담음 / 자료를 구조화 시키기 위해 자료형에 따라 데이터를 넣음
    자료형(타입) : 정수, 문자, 실수 등등
    연산 : /*-+

    논리를 펼치기 위해 if문 사용

    빠르게 반복처리 하기 위해 for, while문 사용

    > 합쳐서 동작을 만듬 >> 함수, 메서드

    ----------------------------------------
    객체 생성하는 방법의 의미 이해, 자바 메모리 이해

    String str = null; >>  원시값 그대로 들어가 있음
    String str = " "; >> 빈 값을 담고 있음

    처음 담아서 세팅하는 값 : 초기값이라고 함

    클래스의 맴버변수는 어느 위치든 꺼내 쓸 수 있음

    main은 가상머신과 소통하기 위한 매서드
    main은 같은 클래스에 있는 맴버변수에 영향을 받지 않는다.


    // 객체 생성 코드 형식
    클래스 타입 객체참조변수 = new 클래스 생성자();
    클래스 타입 : 여러 변수들을 들어가 있는 클래스를 클래스 타입으로 만들어서 사용
    객체참조변수 : 객체의 주소를 담는 변수(객체의 주소를 알려줌+
    new : 메모리 공간 영역을 잡아주는 공간
    클래스 생성자();: 생성 시키는 것을 관여하는 매서드
    슈퍼 찾아가서 오브젝트를 만나 객체가 만들어짐

    t. . > 접근하다


    생성자 : 클래스 이름과 매서드 이름과 동일
    생성자가 없으면 스스로 만들어서 씀
    객체 생성할 때 사용하는 매서드
    super이라는 매서드가 생략되어 있음
    클래스에는 extends Object가 생략되어 있음 상위 Object를 불러서 객체를 생성함


    Object : 객체를 생성시킴
    클래스 요소 : 변수, 생성자, 상수, 매서드


   >> 값의 다형성
    오버로딩  : 이름은 같은데 변수와 값에 따라서 용도가 다른 것
    값을 재정의 하는 것 : 오버라이딩
    업캐스팅 : 상위로 캐스팅함
     자식을 객체 생성을 했지만 부모의 클래스에 담음

    디폴트 : 패키지 있는 곳에서 쓸 수 있음
    퍼블릭과 프라이빗을 많이 씀

     */


/*
1장 6 - 태그로 이루어진 언어
7 - ip주소를 일일이 치기 어렵기 때문에 도메인 변수에 ip를 담음
고정 ip는 서버로 사용> 비쌈 , 클라이어트는 유동ip를 줌 > 저렴
프로토콜://호스트주소[포트번호]/파일의 전체경로/파일이름
프로토콜 : 네트워크에서 사용하는 인터넷 표준 규약 > 통신 규약
포트번호 : 사이트 들어가기 위한 문 (전세계 문 : 80 번으로 정해짐 써야하나 생략됨)

rowspan > 아래 줄 합침
list 태그 >  ul은 점점점으로 나오고 oi은 순번을 매겨서 나온다
<dl>
  <dt>Coffee</dt>
  <dd>- black hot drink</dd> 하위 속성을 만든다.
  보통 ul을 쓰고 css와 연결한다.

  i프레임

 */


}
