package New;

public class New_24_09_23 {
    /*
스크립트 > 컴파일 없이 바로 해걷외는 인터프리터 언어
자바 > jsp
서블릿 이라는 프로그램으로 웹을 만듬
웹에 특화된 프로그램, 웹을 하기 위해 만든 프로그램,웹페이지를 동적으로 만듬

서블릿을 이옹해 자바를 웹페이지에 동작할 수 있도록 만듬

서버가 있어야 서버위에 만들 수 있음
서버를 설치해야함 >> 앱을 구동시키기 위한 서버 >> 웹서버

자바 제공 서버 : 톰켓 다운로드 받아서 프로젝트 위에 올려 놓고 사용


이해가 안되는 부분
1. 톰캣이 서플리스을 설치하는 건가?
2.

jsp : html 코드 상에 자바 언어를 섞어서 만듬
> 서버 위에 올라가져 있음 > 회원 주소 클릭 > 프로그램 해석은 서버가 함 > Html코드로 바꿔짐
> html으로 보여지고 브라우저를 통해 보여줌 > html은 브라우저가 해석해서 보여줌

연산처리하고 보내주면 브라우저가 보여줌
프로그램 영역은 서버가 해석해줌

jsp을 서블릿으로 바꾸고 실행해서 데이터를 뽑아서 jsp로 넘겨줌
서블릿이 속도가 더 빠름 변화하는 게 없으니깐

자바와 데이터베이스의 연결
데이터 송신을 위해서

스트링은 00000숫자로 이어져 있어서 소스코드를 연결시켜줌
메모리 공간에서 달리 생겨남 String in = "sdfsf"; > 공통적인 영역에 생겨나서 들어감

String String빌더 String범퍼 전용구장 있는지 없는지 차이

프로그램 만든다 > 데이터를 조작하기 위함
데이터 조작하는 것을 컨트롤 > 데이터베이스 학습
데이터 삭제, 수정 등

varchar : 가변적으로 움직이는 문자    char : 글자 고정되어 잇음 (하나써도 100바이트)
커밋 : qksdudtlzlrpTek.
코딩하고 커밋해야 반영시키는데 내부적으로 편리하게 자동 커밋되도록 저장되도록 되어 있음
자동커밋이 되면 수정하기 힘듬 커밋하기전에 살펴보고 커킷하는 과정이 있음 (수동 > 오라클)
데이터를 꺼내서 웹 화면헤 호출함

명령어를 통해서 커밋하는 방식

Sql > 구조화된 질문 언어
curd 작업 사용

쿼리 : 테이터 등록 수정 삭제 하는 어너
쿼리 종류
구조조작언어, 조작언어, 확정언어
오라클은 varchar2 mySqlvarchar

객체들은 상속을 받음
*은 모든 것
속성 : 테그에 어떤 속성을 가지고 있는 것들만 스타일을 바꿈


     */


    /*
    동영상
    <video src = "./video/Drama.mp4" width = "600px" height = "300px" controls> </video>
    오디오
    <audio src = "./video/Drama.mp4" controls> </audio>
    많은 사람들이 보는 동영상은 동영상 서버를 만들어서 접속하여 볼 수 있게 증설하여 서비스를 한다.

문서의 구조화
구글 검색엔진이 돌아갈 수 있는 키워드를 가지고 있어야함
검색 엔진이 접근하기 쉽게 하기

시맨틱 태그  > 문서를 구조화하여 나눈 캐드글


name 사용자가 입력하게 되면  name이라는 변수에 값에 담음
     */
}
