package MiniAnswer.test;

public class 참고 {
    // 각 기능 함수화
    /* 가독성이 좋아지고 재활용성
    지역 변수 ( 함수에서만 사용하고 버림)
        - 외부에 영향 최소화

     */

    /*
    네이버 뉴스 > 핸드폰 or pc >> 보는용 모양이 다름
    뉴스 정보(본질) 각각 분리하는 것이 아니라 각각에 적합하게 보여줌
    본질 = 실체 없음 > 보기 쉽게 만듬
    보는걸 뷰라고 함
     */

    /*
    프로그램이
    정보(데이터) 처리 > cont
     */

    /*
    레스토랑 > 서빙 / 주방 / 창고
    작은 프로그램에서는 혼자서 가능
    대규모 프로그램이라면 혼자서 어려움
    다 할 수 있더라도 집중적으로 할 수 있는 부분을 뽑음

    프로그램이 커지면 분리해서 만듬
    1. 분업이 쉬움 // 모델, 뷰쪽 으로 모집하는게 쉬움
    2. 한 분야에 대해서 아는게 더 쉽고 전문성을 가짐

    역사적으로 인정 받은게 MVC
     */

    /*
    어떻게 적용하는가

    mvc 패턴
    자바는 객체가 수행
    (요리 객체, 서빙객체, 창고 객체)
    1. 창고 관리 Dao Repository
    >> post가 가장 중요한 재료 >> 관리 필요
    2. 서빙 관리 view
    >> 보여지는 것들 // ""안은 없음
     */



}
